// RGB7012 - Цаг минут секунд
// Өгөгдсөн секундыг цаг минут секунд болго.

// Input
// Секунд Int төрлийн тоон утгаар өгөгдөнө.

// Output
// Цаг, минут, секундууд хоорондоо 1 зайгаар тусгаарлагдан хэвлэгдэнэ. Цаг минут руу шилжихгүй бол 0 хэвлэнэ.

// Example
// Input:
// 3612
// Output:
// 2 1 0 12

function time(num) {
  sec = num % 60;
  min = ((num - sec) / 60) % 60;
  h = (num - min * 60 - sec) / 3600;
  console.log("h", h, "min", min, "sec", sec);
}
time(3612);

// return x % 60;   12 sec
// return x / 60 - 60 - ((x / 60 - 60) % 1); 0   min
//return (x - (x % 3600)) / 3600;  1   hour
